app/controllers/expenses_controller.rb

  def index
    @expenses = Expense.all
---
SELECT "expenses".* FROM "expenses"

  def create
    @expense = Expense.new(expense_params)
    @expense.status = "on hold"
    @expense.empid = current_user.id
    respond_to do |format|
      if @expense.save
---
INSERT INTO "expenses" ("category", "date", "amount", "invoice", "description", "status", "created_at", "updated_at", "empid") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

    def set_expense
      @expense = Expense.find(params[:id])
---
SELECT "expenses".* FROM "expenses" WHERE "expenses"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]